Autodesk.Revit.DB.PropertySetElement.SetThermalAsset(Autodesk.Revit.DB.ThermalAsset)
Sets a copy of the given ThermalAsset to be used in the PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetElement.GetThermalAsset
Gets a copy of the ThermalAsset.
Since:
2012

Autodesk.Revit.DB.PropertySetElement.SetStructuralAsset(Autodesk.Revit.DB.StructuralAsset)
Sets a copy of the given StucturalAsset to be used in the PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetElement.GetStructuralAsset
Gets a copy of the StructuralAsset.
Since:
2012

Autodesk.Revit.DB.PropertySetElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ThermalAsset)
Creates a new PropertySetElement to contain the given asset.
document:
The document in which to create the PropertySetElement.
thermalAsset:
The thermal asset containing the values that will be present in the PropertySetElement.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetElement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.StructuralAsset)
Creates a new PropertySetElement to contain the given asset.
document:
The document in which to create the PropertySetElement.
structuralAsset:
The structural asset containing the values that will be present in the PropertySetElement.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetElement.Duplicate(Autodesk.Revit.DB.Document,System.String)
Creates a duplicate of this PropertySetElement.
document:
The document in which to create the PropertySetElement.
name:
The name to use for the new PropertySetElement.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for name is already in use as a property set name.
-or-
name is an empty string.
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetElement
An element that groups together a set of related parameters.
Since:
2012